# HScale3D

## Description
Scales a 3D object.

```pascal
PROCEDURE HScale3D(
				h       : HANDLE;
				centerX : REAL;
				centerY : REAL;
				centerZ : REAL;
				scaleX  : REAL;
				scaleY  : REAL;
				scaleZ  : REAL);
```

```python

def vs.HScale3D(h, centerX, centerY, centerZ, scaleX, scaleY, scaleZ):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|centerX|REAL||
|centerY|REAL||
|centerZ|REAL||
|scaleX|REAL||
|scaleY|REAL||
|scaleZ|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Object Editing